NAME :ASHISH PARULEKR
MOB: 8149717616

*** Please let me know if there is any improvement  ***

In [71]:
import pandas as pd

In [ ]:
Q1. Create a Pandas Series that contains the following 
data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [72]:
Se=pd.Series(data=(4, 8, 15, 16, 23,42))

In [73]:
print(Se)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function 
on the variable print it.

In [74]:
var=[chr(i)  for i in range (65,76)]

In [75]:
var

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K']

In [76]:
print(pd.Series(var))

0     A
1     B
2     C
3     D
4     E
5     F
6     G
7     H
8     I
9     J
10    K
dtype: object

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:

In [77]:
Data={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}

In [78]:
Df=pd.DataFrame(Data)

In [79]:
Df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? 
Explain with an example.

Pandas Series

A pandas series is a one-dimensional data structure that comprises of key-value pair, where k    eys/labels are the indices and values are the values stored on that index. It is similar to a python dictionary, except it provides more freedom to manipulate and edit the data

Pandas DataFrame
   
A pandas DataFrame is a two-dimensional data structure that can be thought of as a spreadsheet. It can also be thought of as a collection of two or more series with common indices.

In [80]:
Se

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [81]:
Se.ndim  #.......... series Dimension

1

In [82]:
Df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [83]:
Df.ndim #...................Dataframe Dimensions

2

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
'Common Data Manulpulation Functions:-'
.iloc,.loc,.describe(),.info(),.value_counts(),.Sort_values(),.groupby(),.head().tail()

In [42]:
Df.iloc[[0,2],]

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
DataFrame and Panel is mutable

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [85]:
S1=['Name','Alice','Bob','Claire']
S2=['Age',25,30,27]
S3=['Gender','Female','Male','Female']

In [86]:
S1=pd.Series(S1)
S2=pd.Series(S2)
S3=pd.Series(S3)

In [87]:
Df_1=pd.DataFrame([S1,S2,S3])

In [88]:
Df_1

        0       1     2       3
0    Name   Alice   Bob  Claire
1     Age      25    30      27
2  Gender  Female  Male  Female

In [89]:
Df_1.transpose()

        0    1       2
0    Name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

END